{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-f4c6250224e0>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "trainable": true, "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 24, "nb_col": 5, "name": "convolution2d_1", "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 36, "nb_col": 5, "name": "convolution2d_2", "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 48, "nb_col": 5, "name": "convolution2d_3", "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_4", "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "init": "he_normal", "activity_regularizer": null, "bias": true, "trainable": true, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_5", "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "activation": "linear", "bias": true, "trainable": true, "output_dim": 1164, "name": "dense_1", "input_dim": 1152, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "activation": "linear", "bias": true, "trainable": true, "output_dim": 100, "name": "dense_2", "input_dim": 1164, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "activation": "linear", "bias": true, "trainable": true, "output_dim": 100, "name": "dense_3", "input_dim": 100, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "activation": "linear", "bias": true, "trainable": true, "output_dim": 10, "name": "dense_4", "input_dim": 100, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "init": "he_normal", "activation": "linear", "bias": true, "trainable": true, "output_dim": 1, "name": "dense_5", "input_dim": 10, "b_regularizer": null}}], "keras_version": "1.2.0"}