{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa <ipython-input-188-92ba1d344bdb>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "output_shape_type": "raw", "name": "lambda_3", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "bias": true, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_11", "nb_filter": 24, "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_row": 5, "nb_col": 5, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_19"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "bias": true, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_12", "nb_filter": 36, "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_row": 5, "nb_col": 5, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_20"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "bias": true, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_13", "nb_filter": 48, "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_row": 5, "nb_col": 5, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_21"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "bias": true, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_14", "nb_filter": 64, "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_row": 3, "nb_col": 3, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_22"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "bias": true, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_15", "nb_filter": 64, "b_regularizer": null, "init": "he_normal", "trainable": true, "nb_row": 3, "nb_col": 3, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_23"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_11", "output_dim": 1164, "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "init": "he_normal", "trainable": true, "input_dim": 1152}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_24"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_12", "output_dim": 100, "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "init": "he_normal", "trainable": true, "input_dim": 1164}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_25"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_13", "output_dim": 50, "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "init": "he_normal", "trainable": true, "input_dim": 100}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_26"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_14", "output_dim": 10, "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "init": "he_normal", "trainable": true, "input_dim": 50}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_27"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_15", "output_dim": 1, "W_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "b_constraint": null, "b_regularizer": null, "init": "he_normal", "trainable": true, "input_dim": 10}}]}